{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "embedding_1_input"}}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 10], "dtype": "float32", "input_dim": 9101, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 10}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 7, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel", "shape": [64, 512], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel", "shape": [64, 512], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 7], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [7], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [9101, 64], "dtype": "float32"}]}]}